app/controllers/test_controller.rb

SELECT "tests".* FROM "tests"
---
    def index
        test = Test.all

SELECT "tests".* FROM "tests" WHERE "tests"."id" = 1 LIMIT 1
---
    def show
        test = Test.find(params[:id])