app/controllers/user_controller.rb

SELECT "users".* FROM "users" WHERE "users"."id" = 1 LIMIT 1
---
    def show
        users = User.find(params[:id])